# Contains Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarContainer..::..Contains Method
RebarContainer Class See Also
---
Checks if the RebarContainer has this item as one of its members.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public bool Contains(
	RebarContainerItem pItem
)
```

Visual Basic
---
```text
Public Function Contains ( _
	pItem As RebarContainerItem _
) As Boolean
```

Visual C++
---
```text
public:
bool Contains(
	RebarContainerItem^ pItem
)
```

# ### Parameters
pItem
    Type: Autodesk.Revit.DB.Structure..::..RebarContainerItem The item to be checked if RebarContainer has it as one of its members
# ### Return Value
True if RebarContainer has this item as one of its members, false otherwise.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
RebarContainer Class
Autodesk.Revit.DB.Structure Namespace